In [2]:
import os
import numpy as np
import pandas as pd

### 1.	Create a program that asks the user to enter their name and their age. Print out a message that tells them the year that they will turn 100 years old

In [18]:
a = input('Enter your Name : ')
b = int(input ('Enter your Age :'))
c = -(b-100)
d = 2022+c
print ("You Will Turn 100 Years Old in : ", d)

Enter your Name : Guhan
Enter your Age :31
You Will Turn 100 Years Old in :  2091

## 2.	What is pandas groupby? Demonstrate with your own example

###  groupby() function used in pandas for grouping the data according to user required categories, for example by using Mean() or Median()

In [34]:
df = pd.DataFrame({'Subject': ['Maths', 'Science',
                              'Maths', 'Science'],
                   'Marks': [95, 96, 89, 96.]})

In [35]:
df

   Subject  Marks
0    Maths   95.0
1  Science   96.0
2    Maths   89.0
3  Science   96.0

In [36]:
df.groupby(['Subject']).mean()

         Marks
Subject
Maths     92.0
Science   96.0

## 3.	How to create a dataframe from list?

In [37]:
list1 = [[1,2,3,4],[7,8,9,10]] ## this is list

In [39]:
pd.DataFrame(list1) ## list1 got converted in to a DataFrame

   0  1  2   3
0  1  2  3   4
1  7  8  9  10

## 4.	What are the ways to combine the dataframe in pandas. Give an example for each

In [41]:
df1 = pd.DataFrame([[1,2,3],[4,5,6],[7,8,9]])
df2 = pd.DataFrame([[11,12,13],[14,15,16],[17,18,19]])

In [43]:
df1

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [44]:
df2

    0   1   2
0  11  12  13
1  14  15  16
2  17  18  19

## Append

In [47]:
df1.append(df2)

    0   1   2
0   1   2   3
1   4   5   6
2   7   8   9
0  11  12  13
1  14  15  16
2  17  18  19

## Concat

In [48]:
pd.concat([df1,df2])

    0   1   2
0   1   2   3
1   4   5   6
2   7   8   9
0  11  12  13
1  14  15  16
2  17  18  19

 ###  5.	What is the difference between list and tuples in Python?

## List:
#### List are mutable

In [49]:
l1 = [1,2,3,4,5,6]  ## list of values
l1

[1, 2, 3, 4, 5, 6]

In [50]:
l1[3]=8 ## Assigning value 8 to the forth location

In [51]:
l1 ## new list which is mutable

[1, 2, 3, 8, 5, 6]

###  Tuple
#### Tuples  are immutable

In [52]:
l2 = (1,2,3,4,5,6)

In [60]:
type(l2)

tuple

In [61]:
l2[3] = 5

TypeError: 'tuple' object does not support item assignment

### 6.	Find out the mean, median and standard deviation of this numpy array -> np.array([1,5,3,100,4,48])

In [62]:
a = np.array([1,5,3,100,4,48])

In [66]:
np.mean(a)

26.833333333333332

In [65]:
np.median(a)

4.5

In [67]:
np.std(a)

36.59424666377065

### 7.	How will you remove duplicate elements from a list?

In [73]:
l3 = [1,2,2,3,4,4,4,5,5,5,6,6,]

In [77]:
s1 = list(set(l3))  ## set eliminates the duplicate values from the list 
s1

[1, 2, 3, 4, 5, 6]

### 8.	What is a map() function in Python? Give an example

1. Map takes in a function and a list of argument/dict
2. Every items in the list will be returned based on the function that we're performing

In [81]:
l1 = ['g','u','h','a','n']
u1 = list(map(lambda x :x.upper(),l1)) ## Map gunction performing 
                                       ## the upper function of l1
u1

['G', 'U', 'H', 'A', 'N']

### 9.	What is pass in Python?

'Pass' statement is used as a placeholder for future execution. 
'pass' gives no output whwn it got executed

In [82]:
for i in range(10):
    pass

### 10.	What is vstack() in numpy? Give an example

Stack two arrays Verticaly

In [86]:
df1 = pd.DataFrame([[1,2,3],[4,5,6],[7,8,9]])
df2 = pd.DataFrame([[11,12,13],[14,15,16],[17,18,19]])

In [90]:
np.vstack((df1,df2))

array([[ 1,  2,  3],
       [ 4,  5,  6],
       [ 7,  8,  9],
       [11, 12, 13],
       [14, 15, 16],
       [17, 18, 19]], dtype=int64)